; domain
(define (domain HARBOR_V01)
  (:requirements :strips :typing)
  (:types block stack crane bottom)
  (:predicates (hold ?c - crane ?x - block)
  	       (empty_crane ?c - crane)
	       (empty_tape)
	       (block_in_tape ?x - block)
	       (available ?x - block)
	       (on ?x - block ?y - (either block bottom) )
	       (top ?x - (either block bottom))
	       (at ?x - (either block bottom) ?s - stack)
	       (handle ?c - crane ?s - stack)
	       
  )
  (:action pick-from-stack
    :parameters (?x - block ?y - (either block bottom) ?s - stack ?c - crane)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (top ?y)
            )
  )
  (:action put-on-stack
    :parameters (?x - block ?y - (either block bottom) ?s - stack ?c - crane)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
    		  )
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
            )
  )
  (:action pick-from-tape
    :parameters (?x - block ?c - crane)
    :precondition (and (block_in_tape ?x)
                       (empty_crane ?c))
		       
    :effect (and (not (block_in_tape ?x)) (not (empty_crane ?c))
                 (empty_tape) (hold ?c ?x))
  )
  (:action put-on-tape
    :parameters (?x - block ?c - crane)
    :precondition (and (empty_tape)
                       (hold ?c ?x))
		       
    :effect (and (block_in_tape ?x) (empty_crane ?c)
                 (not (empty_tape)) (not (hold ?c ?x)))
  )
)

; problem
(define (problem HARBOR_P01_V01)
(:domain HARBOR_V01)
(:objects C1 C2 - crane B1 B2 B3 B4 B5 B6 B7 B8 B9 B10 B11 - block
          S1 S2 S3 S4 S5 S6 - stack BOT1 BOT2 BOT3 BOT4 BOT5 BOT6 - bottom)
(:init (EMPTY_CRANE C1)
       (EMPTY_CRANE C2)
       (EMPTY_TAPE)
       (AT BOT1 S1)
       (AT BOT2 S2)
       (AT BOT3 S3)
       (AT BOT4 S4)
       (AT BOT5 S5)
       (AT BOT6 S6)
       (HANDLE C1 S1)
       (HANDLE C1 S2)
       (HANDLE C1 S3)
       (HANDLE C2 S4)
       (HANDLE C2 S5)
       (HANDLE C2 S6)
       (ON B1 BOT1)
       (AT B1 S1)
       (ON B2 B3)
       (AT B2 S5)
       (TOP B2)
       (ON B3 B5)
       (AT B3 S5)
       (ON B4 BOT4)
       (AT B4 S4)
       (ON B5 BOT5)
       (AT B5 S5)
       (ON B6 BOT6)
       (AT B6 S6)
       (TOP B6)
       (ON B7 B1)
       (AT B7 S1)
       (TOP B7)
       (ON B8 B4)
       (AT B8 S4)
       (TOP B8)
       (ON B9 BOT2)
       (AT B9 S2)
       (ON B10 B9)
       (AT B10 S2)
       (TOP B10)
       (ON B11 BOT3)
       (AT B11 S3)
       (TOP B11)
)

(:goal (and (AT B1 S5)  (AT B2 S5)  (AT B3 S5)  (AT B4 S5)  (AT B5 S5)  (AT B6 S5)  (AT B7 S5)  (AT B8 S5)  (AT B9 S5)  (AT B10 S5)  (AT B11 S5))))

; plan
1. (pick-from-stack b7 b1 s1 c1)
   deleted: (empty_crane c1) (on b7 b1) (at b7 s1) (top b7)
   added: (hold c1 b7) (top b1)
   goals met: 3 of 11
2. (put-on-stack b7 b10 s2 c1)
   deleted: (hold c1 b7) (top b10)
   added: (empty_crane c1) (on b7 b10) (at b7 s2) (top b7)
   goals met: 3 of 11
3. (pick-from-stack b1 bot1 s1 c1)
   deleted: (empty_crane c1) (on b1 bot1) (at b1 s1) (top b1)
   added: (hold c1 b1) (top bot1)
   goals met: 3 of 11
4. (put-on-tape b1 c1)
   deleted: (empty_tape) (hold c1 b1)
   added: (block_in_tape b1) (empty_crane c1)
   goals met: 3 of 11
5. (pick-from-tape b1 c2)
   deleted: (block_in_tape b1) (empty_crane c2)
   added: (empty_tape) (hold c2 b1)
   goals met: 3 of 11
6. (pick-from-stack b7 b10 s2 c1)
   deleted: (empty_crane c1) (on b7 b10) (at b7 s2) (top b7)
   added: (hold c1 b7) (top b10)
   goals met: 3 of 11
7. (put-on-stack b1 b6 s6 c2)
   deleted: (hold c2 b1) (top b6)
   added: (empty_crane c2) (on b1 b6) (at b1 s6) (top b1)
   goals met: 3 of 11
8. (pick-from-stack b8 b4 s4 c2)
   deleted: (empty_crane c2) (on b8 b4) (at b8 s4) (top b8)
   added: (hold c2 b8) (top b4)
   goals met: 3 of 11
9. (put-on-tape b8 c2)
   deleted: (empty_tape) (hold c2 b8)
   added: (block_in_tape b8) (empty_crane c2)
   goals met: 3 of 11
10. (pick-from-stack b4 bot4 s4 c2)
   deleted: (empty_crane c2) (on b4 bot4) (at b4 s4) (top b4)
   added: (hold c2 b4) (top bot4)
   goals met: 3 of 11
11. (put-on-stack b4 b2 s5 c2)
   deleted: (hold c2 b4) (top b2)
   added: (empty_crane c2) (on b4 b2) (at b4 s5) (top b4)
   goals met: 4 of 11
12. (pick-from-stack b1 b6 s6 c2)
   deleted: (empty_crane c2) (on b1 b6) (at b1 s6) (top b1)
   added: (hold c2 b1) (top b6)
   goals met: 4 of 11
13. (put-on-stack b1 b4 s5 c2)
   deleted: (hold c2 b1) (top b4)
   added: (empty_crane c2) (on b1 b4) (at b1 s5) (top b1)
   goals met: 5 of 11
14. (pick-from-stack b6 bot6 s6 c2)
   deleted: (empty_crane c2) (on b6 bot6) (at b6 s6) (top b6)
   added: (hold c2 b6) (top bot6)
   goals met: 5 of 11
15. (put-on-stack b6 b1 s5 c2)
   deleted: (hold c2 b6) (top b1)
   added: (empty_crane c2) (on b6 b1) (at b6 s5) (top b6)
   goals met: 6 of 11
16. (pick-from-tape b8 c2)
   deleted: (block_in_tape b8) (empty_crane c2)
   added: (empty_tape) (hold c2 b8)
   goals met: 6 of 11
17. (put-on-tape b7 c1)
   deleted: (empty_tape) (hold c1 b7)
   added: (block_in_tape b7) (empty_crane c1)
   goals met: 6 of 11
18. (put-on-stack b8 bot6 s6 c2)
   deleted: (hold c2 b8) (top bot6)
   added: (empty_crane c2) (on b8 bot6) (at b8 s6) (top b8)
   goals met: 6 of 11
19. (pick-from-tape b7 c2)
   deleted: (block_in_tape b7) (empty_crane c2)
   added: (empty_tape) (hold c2 b7)
   goals met: 6 of 11
20. (pick-from-stack b10 b9 s2 c1)
   deleted: (empty_crane c1) (on b10 b9) (at b10 s2) (top b10)
   added: (hold c1 b10) (top b9)
   goals met: 6 of 11
21. (put-on-stack b7 b6 s5 c2)
   deleted: (hold c2 b7) (top b6)
   added: (empty_crane c2) (on b7 b6) (at b7 s5) (top b7)
   goals met: 7 of 11
22. (put-on-stack b10 b11 s3 c1)
   deleted: (hold c1 b10) (top b11)
   added: (empty_crane c1) (on b10 b11) (at b10 s3) (top b10)
   goals met: 7 of 11
23. (pick-from-stack b8 bot6 s6 c2)
   deleted: (empty_crane c2) (on b8 bot6) (at b8 s6) (top b8)
   added: (hold c2 b8) (top bot6)
   goals met: 7 of 11
24. (pick-from-stack b9 bot2 s2 c1)
   deleted: (empty_crane c1) (on b9 bot2) (at b9 s2) (top b9)
   added: (hold c1 b9) (top bot2)
   goals met: 7 of 11
25. (put-on-stack b8 b7 s5 c2)
   deleted: (hold c2 b8) (top b7)
   added: (empty_crane c2) (on b8 b7) (at b8 s5) (top b8)
   goals met: 8 of 11
26. (put-on-tape b9 c1)
   deleted: (empty_tape) (hold c1 b9)
   added: (block_in_tape b9) (empty_crane c1)
   goals met: 8 of 11
27. (pick-from-tape b9 c2)
   deleted: (block_in_tape b9) (empty_crane c2)
   added: (empty_tape) (hold c2 b9)
   goals met: 8 of 11
28. (pick-from-stack b10 b11 s3 c1)
   deleted: (empty_crane c1) (on b10 b11) (at b10 s3) (top b10)
   added: (hold c1 b10) (top b11)
   goals met: 8 of 11
29. (put-on-stack b9 b8 s5 c2)
   deleted: (hold c2 b9) (top b8)
   added: (empty_crane c2) (on b9 b8) (at b9 s5) (top b9)
   goals met: 9 of 11
30. (put-on-tape b10 c1)
   deleted: (empty_tape) (hold c1 b10)
   added: (block_in_tape b10) (empty_crane c1)
   goals met: 9 of 11
31. (pick-from-tape b10 c2)
   deleted: (block_in_tape b10) (empty_crane c2)
   added: (empty_tape) (hold c2 b10)
   goals met: 9 of 11
32. (pick-from-stack b11 bot3 s3 c1)
   deleted: (empty_crane c1) (on b11 bot3) (at b11 s3) (top b11)
   added: (hold c1 b11) (top bot3)
   goals met: 9 of 11
33. (put-on-stack b10 b9 s5 c2)
   deleted: (hold c2 b10) (top b9)
   added: (empty_crane c2) (on b10 b9) (at b10 s5) (top b10)
   goals met: 10 of 11
34. (put-on-tape b11 c1)
   deleted: (empty_tape) (hold c1 b11)
   added: (block_in_tape b11) (empty_crane c1)
   goals met: 10 of 11
35. (pick-from-tape b11 c2)
   deleted: (block_in_tape b11) (empty_crane c2)
   added: (empty_tape) (hold c2 b11)
   goals met: 10 of 11
36. (put-on-stack b11 b10 s5 c2)
   deleted: (hold c2 b11) (top b10)
   added: (empty_crane c2) (on b11 b10) (at b11 s5) (top b11)
   goals met: 11 of 11
